StoryBoards/app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
    @developers = Developer.all
    @projects = Project.all
---
SELECT "admins".* FROM "admins"
SELECT "developers".* FROM "developers"
SELECT "projects".* FROM "projects"

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Asish"], ["email", "akottal@ncsu.edu"], ["password", "test456"], ["created_at", "2015-02-01 20:58:16.551167"], ["updated_at", "2015-02-01 20:58:16.551167"]]

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE "admins" SET "password_digest" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["password_digest", "$2a$10$FlDYbNwKdjLojtGF2fwjFemetgG10EKRtCAhmcJr3RgPhvcAYs4D2"], ["updated_at", "2015-02-10 04:16:57.387693"], ["id", 1]]

  def destroy
    @admin = Admin.find(params[:id])
    @admin.destroy
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]