StoryBoards/app/controllers/developers_controller.rb

SELECT "developers".* FROM "developers"
---
  def index
      redirect_if_not_login
      redirect_if_not_admin
      @developers = Developer.all

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "stories".* FROM "stories" WHERE "stories"."developer_id" = ? LIMIT 1  [["developer_id", 2]]
SELECT "stories".* FROM "stories"
---
  def show
    redirect_if_not_login
    @d = Developer.find(params[:id])
    redirect_if_not_same_user(@d) if !is_admin
    @project = nil
    @story   = nil
    if @d.project_id != nil
      @project = Project.find(@d.project_id)
    end
    if @d.story_id != nil
      @story = Story.find(@d.story_id)
    end
    @stories_created = Story.all.select { |s| s.developer_id == params[:id].to_i}

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    redirect_if_not_login
    developer = Developer.find(params[:id])

INSERT INTO "developers" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "User3"], ["email", "user3@ncsu.edu"], ["password_digest", "test123"], ["created_at", "2015-02-04 05:46:17.416394"], ["updated_at", "2015-02-04 05:46:17.416394"]]
---
  def create
    @developer = Developer.new(developer_params)
    respond_to do |format|
      if @developer.save

UPDATE "developers" SET "password_digest" = ?, "updated_at" = ? WHERE "developers"."id" = ?  [["password_digest", "$2a$10$S1eWxgSgMGWcumlS3rSNf.Q9687mYaUGR1VW/DzRzru3rkV/EST.q"], ["updated_at", "2015-02-10 06:34:10.700143"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @developer.update(developer_params)

DELETE FROM "developers" WHERE "developers"."id" = ?  [["id", 1]]
---
  def destroy
    @developer.destroy

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_developer
      @developer = Developer.find(params[:id])