StoryBoards/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT "developers".* FROM "developers"
---
  def index
    @projects = Project.all
    @developers = Developer.all.select {|dev| dev.project_id == 1}

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "developers".* FROM "developers" WHERE "developers"."project_id" = ? LIMIT 1  [["project_id", 1]]
SELECT "stories".* FROM "stories"
---
  def show
    @project = Project.find(params[:id] )
    @developers = Developer.all.select {|dev| dev.project_id == params[:id].to_i}
    @stories = Story.all.select {|story| story.project_id == params[:id].to_i}

INSERT INTO "projects" ("burndown", "bdtime", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["burndown", nil], ["bdtime", nil], ["title", "Project 2"], ["description", "This is second project"], ["created_at", "2015-02-13 18:47:40.318135"], ["updated_at", "2015-02-13 18:47:40.318135"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save