StoryBoards/app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "vareti@ncsu.edu"]]
SELECT  "developers".* FROM "developers" WHERE "developers"."email" = ? LIMIT 1  [["email", "user4@ncsu.edu"]]
---
  def create
    user = Admin.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      log_in user
      redirect_to admins_path
    else
      user = Developer.find_by(email: params[:session][:email].downcase)