StoryBoards/app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    if !is_admin
      dev_redirect
    end
    @stories = Story.all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "developers".* FROM "developers"
---
  def show
    @story = Story.find(params[:id])
    redirect_if_not_proj_mem(@story)
    @developers = Developer.all.select {|dev| dev.story_id == params[:id].to_i}

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "stories" ("title", "description", "point_value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Stroty1"], ["description", "This is story 1"], ["point_value", 10.0], ["created_at", "2015-02-12 01:30:11.518013"], ["updated_at", "2015-02-12 01:30:11.518013"]]
UPDATE "projects" SET "burndown" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["burndown", "---\n- 10\n- 10\n- 10\n- 10\n- 10\n- 14\n- 14\n- 14\n- 14\n- 14\n- 12\n- 22\n"], ["updated_at", "2015-02-13 07:09:25.567259"], ["id", 1]]
---
  def create
    @story = Story.new(story_params)
    @user = current_user
    @story.developer_id = @user.id
    p = Project.find(@story.project_id)
    bd_arr = p.burndown
    btime = p.btime
    btime = btime==nil ? 0 : btime + 1
    if !bd_arr.empty?
      bd_arr << (bd_arr[-1] + return_hours(@story.stage))
    else
      bd_arr << return_hours(@story.stage)
    end

    respond_to do |format|
      if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "bdtime" = ?, "btime" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["bdtime", nil], ["btime", 14], ["updated_at", "2015-02-13 07:45:17.925458"], ["id", 1]]
UPDATE "stories" SET "stage" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["stage", "In Dev"], ["updated_at", "2015-02-12 20:03:55.111799"], ["id", 7]]
---
  def update
    old_stage = Story.find(params[:id]).stage
    new_stage = params[:story][:stage]
    p = Project.find(@story.project_id)
    #cum_hours = return_hours(new_stage)
    cum_hours = return_hours(new_stage) - return_hours(old_stage)
    bd_arr = p.burndown
    btime = p.btime
    btime = btime==nil ? 0 : btime + 1
    if bd_arr.empty?
      bd_arr << (bd_arr[-1] + cum_hours)
    else
      bd_arr << cum_hours
    end
    respond_to do |format|
      if @story.update(story_params)

DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 4]]
---
  def destroy
    d = Developer.all.select{|dev| dev.story_id == params[:id]}
    d.each.update_attributes(:story_id => nil) if !d.empty?

    @story.destroy

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", nil]]
SELECT "developers".* FROM "developers"
UPDATE "developers" SET "story_id" = ?, "updated_at" = ? WHERE "developers"."id" = ?  [["story_id", 0], ["updated_at", "2015-02-12 01:59:10.118455"], ["id", 2]]
---
  def sign_up
    @user = current_user
    @story = Story.find(params[:id])
    @developers = Developer.all.select{|dev| dev.story_id == params[:id].to_i}
    if @developers.size < 2
      respond_to do |format|
        if @user.update_attributes(:story_id => params[:id].to_i)
          format.html { redirect_to @story, notice: 'You signed up for this story. Any existing signed up story will be replaced by this story.'}
          format.json { render :show, status: :ok, location: @story }
        else
          format.html { render :show }
          format.json { render json: @story.errors, status: :unprocessable_entity }
        end
      end
    else
      i = rand > 0.5 ? 1 : 0
      respond_to do |format|
        if @developers[i].update_attributes(:story_id => nil) && @user.update_attributes(:story_id => params[:id].to_i)