StoryBoards/app/views/developers/_form.html.erb

SELECT "projects".* FROM "projects"
---
          <%= f.label :project_id %><br/>
          <%= select("developer", "project_id", Project.all.collect{ |c| [ c.title, c.id] }) %>