StoryBoards/app/views/stories/_form.html.erb

    <%= f.label :project_id %><br/>
    <%= select("story", "project_id", Project.all.collect{ |c| if c.id == @user.project_id  then [ c.title, c.id]  end}) %>
---
SELECT "projects".* FROM "projects"